tutorials/incompressibleVoF/floatingObjectWaves/system/functions.sixDoF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sixDoFRigidBodyState
{
    type           sixDoFRigidBodyState;
    libs           ("libsixDoFRigidBodyState.so");
    angleUnits     degrees;
}

// ************************************************************************* //
